<template>
  <div class="about">
    <yilan-nav></yilan-nav>
    <el-row
      v-for="(val, key, index) in about"
      :key="index"
      :gutter="20"
      class="box"
    >
      <el-col :offset="3" :span="18">
        <div class="title">{{ key }}</div>
        <div class="item" v-for="(item, i) in val" :key="i">
          <span>{{ item }}</span>
        </div>
      </el-col>
    </el-row>
    <yilan-foo></yilan-foo>
  </div>
</template>

<script>
import nav from "../../components/Nav";
import foo from "../../components/Foo";

export default {
  name: "About",
  components: {
    "yilan-nav": nav,
    "yilan-foo": foo,
  },
  data() {
    return {
      about: {
        关于本站: [
          "易览博客于2020年8月底开设搭建，专注于设计一个简单易用的博客平台。",

          "易览坚持开放、分享、成长的宗旨，每周召集众多设计总监、资深设计人员、设计爱好者等杰出人物，分享他们关于职业的技术、理念、思考和探索。"
        ],
        用户协议: [
          "欢迎您使用易览博客服务（下称：本服务）",

          "请您仔细阅下方条款，若您对本协议的任何条款存有异议，您可以第一时间选择不进入易览。",

          "当您在本平台注册，在进入博客后发布的任何内容均意味着您（即用户）完全接受本协议项下的全部条款。",

          "易览有权随时对本协议进行修改，用户在登录使用前如果不同意本协议的修改，可以放弃使用或访问本网站，如果用户选择在本协议变更后继续访问或使用本网站，则视为用户已经接受本协议的修改。",

          "1. 用户应遵守中华人民共和国相关法律法规，并同意对以任何方式使用用户账号而使用本服务的任何行为及其结果承担全部责任。如用户的行为违反国家法律，用户将依法承担全部法律责任；如涉嫌构成犯罪，司法机关将追究用户的刑事责任，优设将严格按照法律规定的义务及司法机关的要求进行配合。同时，如果易览有理由认为用户的任何行为，包括但不限于用户的任何言论或其它行为违反或可能违反国家法律法规的任何规定，易览可在任何时候不经任何事先通知终止向用户提供服务。",
          "2. 用户应遵守所有与本服务有关的网络协议、规定和程序。",
          "3. 用户同意将不会利用易览博客制作、上载、复制、发布、传播或者转载如下内容：",

          "------反对宪法所确定的基本原则的；",
          "------危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；",
          "------损害国家荣誉和利益的；",
          "------煽动民族仇恨、民族歧视，破坏民族团结的；",
          "------侮辱、滥用英烈形象，否定英烈事迹，美化粉饰侵略战争行为的；",
          "------破坏国家宗教政策，宣扬邪教和封建迷信的；",
          "------散布谣言，扰乱社会秩序，破坏社会稳定的；",
          "------散布淫秽、赌博、暴力、凶杀、自残、恐怖或者教唆犯罪的；",
          "------侮辱或者诽谤他人，侵害他人合法权益（如名誉权、肖像权等）的；",
          "------侵害他人知识产权、商业秘密等合法权利的；",
          "------虚构事实、隐瞒真相以误导、欺骗他人的；",
          "------发布、传送、传播广告信息及垃圾信息的；",
          "------其他法律法规禁止的行为。",

          "4. 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益。",
          "5. 如用户在使用网络服务时违反任何上述规定，易览或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。",
        ],
        免责声明: [
          "一、博客内文章来自于用户编辑，若有图片和内容侵权，请联系平台管理员953345721@qq.com ，我们会查证删除。",

          "二、本站作者投稿文章仅为资源共享、学习参考之目的，对于本站用户发布的内容，易览不保证其合法性、正当性、准确性。同时，易览不对任何内容承担任何责任，包括但不限于任何内容错误导致的任何损失、损害。",

          "三、本站转载及访客投递的文章资讯均不代表本站观点。严禁在本站发布反动、色情、广告等不良信息。",

          "四、凡以任何方式登陆本网站或直接、间接使用本站资料者，均应仔细阅读本申明，一旦使用本站任何教程和资源，即被视为您已接受本站的免责申明。",

          "感谢大家与易览一起努力，营造一个优秀和谐的网络环境！",
        ],
      },
    };
  },
  methods: {},
};
</script>

<style scoped>
.about {
  width: 100%;
}
.about .box {
  width: calc(100% - 200px);
  margin: 20px 90px !important;
  border-radius: 4px;
  text-align: left;
  line-height: 30px;
}
.about .box .el-col {
  padding: 20px 0;
  background: var(--background3);
}
.about .title {
  padding: 0 30px;
  box-sizing: border-box;
  font-size: 20px;
  color: var(--warning);
}
.about .item {
  line-height: 30px;
  padding: 10px 30px;
  box-sizing: border-box;
  color: var(--background);
}
</style>